label_deviantart=deviantArt
label_email=E-mail
label_facebook=Facebook
label_github=GitHub
label_lastfm=Last.fm
label_linkedin=LinkedIn
label_skype=Skype
label_slideshare=Slideshare
label_steam=Steam
label_twitter=Twitter
tooltip_deviantart=Me encontre no DeviantArt
tooltip_email=Me envie um e-mail
tooltip_facebook=Me encontre no Facebook
tooltip_github=Me encontre no GitHub
tooltip_lastfm=Me encontre no Last.fm
tooltip_linkedin=Me encontre no LinkedIn
tooltip_skype=Entre em contato comigo no Skype\: machado_lucas
tooltip_slideshare=Me encontre no Slideshare
tooltip_steam=Me encontre no Steam
tooltip_twitter=Me encontre no Twitter
menu_blog=Blog
menu_home=In\u00EDcio
menu_photography=Fotografia
menu_portfolio=Portf\u00F3lio
menu_professional=Profissional
menu_timeline=Linha do tempo
menu_title=machadolucas
message_loading=Carregando
title_contact=Contato
what_are_you_looking_for=O que voc\u00EA est\u00E1 procurando?
header_links_professional=Informa\u00E7\u00E3o profissional, como curr\u00EDculo, experi\u00EAncia, habilidades e estudos
header_links_portfolio=Portf\u00F3lio, demos e projetos
header_links_timeline=Linha do tempo e eventos da minha vida
header_links_photography=Meu hobby de fotografia
header_links_blog=Meu blog, not\u00EDcias e atualiza\u00E7\u00F5es
header_links_contact=Informa\u00E7\u00F5es de contato, e-mail e redes sociais
title_about_me=Sobre mim, em algumas palavras
text_about_me_01=Eu sou um desenvolvedor de software atualmente morando em S\u00E3o Paulo, Brasil. Mas eu tamb\u00E9m sou muito mais do que isso.
text_about_me_02=Minha base educacional \u00E9 um bacharelado em Sistemas de Informa\u00E7\u00E3o na Universidade de S\u00E3o Paulo (USP) e um per\u00EDodo de interc\u00E2mbio no departamento da Escola de Sistemas de Informa\u00E7\u00E3o na Universidade de Tampere, Finl\u00E2ndia.
text_about_me_03=Eu tenho experi\u00EAncia principalmente com back-end e tecnologias Java, mas tamb\u00E9m com desenvolvimento front-end. J\u00E1 trabalhei em diversos projetos importantes e inovadores.
text_about_me_04=Tamb\u00E9m tenho conhecimento em usabilidade, acessibilidade, UI, UX, e bastante em design e desenvolvimento de jogos.
text_about_me_05=Jogos, livros, hist\u00F3ria, fotografia, saunas e cabanas tamb\u00E9m s\u00E3o grandes interesses para mim.
tooltip_lucas_portrait=Retrato de Lucas
title_topics_that_turn_me_on=Algumas das coisas e t\u00F3picos que me excitam\:
text_topic_01=M\u00FAsica Metal
text_topic_02=Sauna
text_topic_03=Nadar em buracos de gelo
text_topic_04=Finl\u00E2ndia
text_topic_05=Programa\u00E7\u00E3o
text_topic_06=Fotografia
text_topic_07=Filmes cult
text_topic_08=Inova\u00E7\u00E3o
text_topic_09=Causas sociais
text_topic_10=Feminismo
text_topic_11=Geografia
text_topic_12=Subculturas
text_topic_13=Intera\u00E7\u00E3o humano computador
text_topic_14=Usabilidade
text_topic_15=Jogos
text_topic_16=Design de games
text_topic_17=Cozinhar
text_topic_18=Moda
text_topic_19=Livros
text_topic_20=Psicologia
text_topic_21=F\u00EDsica
text_topic_22=Engenharia
text_topic_23=Comida japonesa
text_topic_24=Arquitetura
text_topic_25=Hist\u00F3ria
text_topic_26=Web Design
text_topic_27=Comida brasileira
text_topic_28=Igualdade
text_topic_29=Planejamento urbano
text_topic_30=Transportes p\u00FAblicos
text_topic_31=Compartilhar conhecimento
text_topic_32=Transhumanismo
title_objective=Objetivo
text_objective=Desenvolver sistemas que fa\u00E7am a diferen\u00E7a na vida das pessoas, resolvendo problemas e fazendo o melhor e mais eficiente c\u00F3digo poss\u00EDvel, aprendendo e compartilhando conhecimento.
title_experience=Experi\u00EAncia
title_uol=UOL
text_uol=UOL \u00E9 um provedor brasileiro de servi\u00E7os online e de internet. \u00C9 o l\u00EDder na Am\u00E9rica Latina e seu portal \u00E9 o maior no mundo da l\u00EDngua portuguesa. A UOL oferece hosting, compras, pagamento e outros servi\u00E7os.
title_job_uol=Analista Desenvolvedor - De dezembro de 2014 at\u00E9 o momento.
text_job_uol=Trabalhando no time de P&D do PagSeguro, um neg\u00F3cio nacional de e-commerce baseado no Brasil que permite pagamentos e transfer\u00EAncia de dinheiro atrav\u00E9s da Internet ou de leitores de cart\u00F5es.
title_culturedude=CultureDude
text_culturedude=CultureDude \u00E9 uma plataforma que ajuda as pessoas a aprender sobre situa\u00E7\u00F5es culturais de uma forma divertida usando jogos culturais,
title_job_culturedude=Desenvolvimento de aplicativos m\u00F3veis - De outubro de 2014, at\u00E9 dezembro de 2014.
text_job_culturedude=Desenvolvimento de aplica\u00E7\u00F5es para a plataforma iOS. Design de gr\u00E1ficos e interfaces.
title_demola=Demola
text_demola=Demola \u00E9 uma plataforma de inova\u00E7\u00E3o que facilita co-cria\u00E7\u00E3o entre estudantes universit\u00E1rios e empresas resolvendo problemas do mundo real.
title_job_demola=Engenheiro de software - De maio de 2014, at\u00E9 agosto de 2014.
text_job_demola=Desenvolvimento de uma plataforma educacional open source para o Minist\u00E9rio da Educa\u00E7\u00E3o da Finl\u00E2ndia entre maio e agosto (Demola Summer).
title_job_demola2=Desenvolvimento de software - De fevereiro de 2014, at\u00E9 maio de 2014.
text_job_demola2=Desenvolvimento de uma ferramenta de visualiza\u00E7\u00E3o de dados de riscos (um jogo baseado em turnos) para a \u00E1rea de seguros, entre fevereiro e maio (Demola Spring).
title_eval=E-Val Tecnologia
text_eval=E-VAL Tecnologia \u00E9 uma empresa especializado em PKI, seguran\u00E7a da informa\u00E7\u00E3o, desenvolvimento de software e business intelligence que se tornou s\u00F3lida no mercado de tecnologia e segue a evolu\u00E7\u00E5o e a dissemina\u00E7\u00E3o do uso de criptografia e PKI no Brasil.
title_job_eval=Desenvolvedor - De junho de 2010 at\u00E9 agosto de 2013.
text_job_eval=An\u00E1lise de requisitos para projetos, desenvolvimento de documenta\u00E7\u00E3o funcional e de design t\u00E9cnico, testes em aplica\u00E7\u00F5es, e desenvolvimento em Java (frontend de sistemas banc\u00E1rios; implementa\u00E7\u00E3o de servi\u00E7os biom\u00E9tricos e de protocolos de autentica\u00E7\u00E3o; interfaces com servidores criptogr\u00E1ficos; e modelos CRUD). Experi\u00EAncia com implementa\u00E7\u00E3o e teste de internacionaliza\u00E7\u00E3o em plataformas de internet banking, e desenvolvimento, uso e teste de APIs e servi\u00E7os web.
title_education=Educa\u00E7\u00E3o
title_usp=Universidade de S\u00E3o Paulo
subtitle_usp=Bacharelado em Sistemas de Informa\u00E7\u00E3o. Iniciado em 2010. Melhor universidade da Am\u00E9rica Latina.
text_usp=Gradua\u00E7\u00E3o esperada pelo final de 2015.
title_project_usp1=1\u00BA Dia do Descarte Legal na EACH/USP
text_project_usp1=Projeto de extens\u00E3o universit\u00E1ria implementado, orientando sobre o descarte correto de lixo eletr\u00F4nico e promovendo a coleta para processamento adequado - 2010.
title_project_usp2=Uma An\u00E1lise Pr\u00E1tica de Relacionamentos entre Dispositivos de Entrada e Heur\u00EDsticas de Jogabilidade.
text_project_usp2=Trabalho de conclus\u00E3o de curso.
title_uta=Universidade de Tampere
subtitle_uta=Estudante de interc\u00E2mbio no programa de Ci\u00EAncias da Computa\u00E7\u00E3o em n\u00EDvel de bacharelado e mestrado - Ano acad\u00EAmico 2013-2014.
text_uta1=Estudos distribu\u00EDdos entre os programas de Ci\u00EAncias da Computa\u00E7\u00E3o, Estudos de Informa\u00E7\u00E3o e M\u00EDdias Interativas, e Estudos da Internet e Jogos.
text_uta2=Tive um grande foco em estudos de jogos, incluindo hist\u00F3ria da ind\u00FAstria, concep\u00E7\u00E3o, prototipagem, itera\u00E7\u00E3o, plataformas e engines, m\u00E9tricas, marketing, propriedade intelectual e avalia\u00E7\u00F5es heur\u00EDsticas.
text_cejw=Col\u00E9gio Embraer Juarez Wanderley
subtitle_cejw=Projeto social mantido pelo Instituto Embraer de Educa\u00E7\u00E3o e Pesquisa, classificado entre os melhores col\u00E9gios do pa\u00EDs segundo o ENEM - Finalizado em 2009.
title_project_cejw1=Curso de Pr\u00E9-engenharia
title_project_cejw2=Programa de Alternativas Sustent\u00E1veis
text_project_cejw1=Estudos dos princ\u00EDpios b\u00E1sicos de tecnologia, f\u00EDsica, qu\u00EDmica, eletricidade, eletr\u00F4nica e computa\u00E7\u00E3o em n\u00EDvel de engenharia (800 horas, 2007-2009.)
text_project_cejw2=O Programa de Alternativas Sustent\u00E1veis \u00E9 focado em gerenciar problemas sociais e ambientais, com consequ\u00EAncias para a comunidade local. Eu atuei como membo e gerenciador de um projeto que buscava solu\u00E7\u00F5es para o reflorestamento nativo de uma \u00E1rea no entorno do col\u00E9gio - 2008.
title_skills=Habilidades
title_spoken_languages=Idiomas
language_portuguese=Portugu\u00EAs
language_english=Ingl\u00EAs
language_finnish=Finland\u00EAs
language_level_native=Nativo
language_level_fluent=Fluente
language_level_basic=B\u00E1sico
title_development_languages=Linguagens de desenvolvimento
language_german=Alem\u00E3o
language_spanish=Espanhol
title_other_development_technologies=Outras tecnologias de desenvolvimento
title_other_skills=Outras Habilidades
item_others=Outros
item_web_accessibility=Acessibilidade na web
item_information_visualization=Visualiza\u00E7\u00E3o de Informa\u00E7\u00E3o
item_usability_evaluation=Avalia\u00E7\u00E3o de usabilidade
item_requirements_engineering=Engenharia de Requisitos
item_game_design=Design de games
item_apis_designing=Design de APIs
title_other_curriculum_formats=Outros formatos de curr\u00EDculo
text_other_cv_1=Talvez voc\u00EA precise de um formato mais tradicional e compacto do meu curr\u00EDculo.
text_other_cv_2=Nesse caso, voc\u00EA tamb\u00E9m pode fazer download de um PDF aqui\:
text_other_cv_3=Aviso\: Esses arquivos podem n\u00E3o ser a vers\u00E3o mais atualizada\! Por favor entre em contato comigo para ter certeza.
in_english=em Ingl\u00EAs
in_portuguese=em Portugu\u00EAs
tooltip_link_eval=Clique para ver mais sobre E-Val Tecnologia
tooltip_link_uol=Clique para ver mais sobre UOL
tooltip_link_demola=Clique para ver mais sobre Demola
tooltip_link_culturedude=Clique para ver mais sobre CultureDude
tooltip_link_usp=Clique para ver mais sobre Universidade de S\u00E3o Paulo
tooltip_link_uta=Clique para ver mais sobre Universidade de Tampere
tooltip_link_cejw=Clique para ver mais sobre Col\u00E9gio Juarez Wanderley
tooltip_link_cv_en=Clique para fazer o download de uma vers\u00E3o pdf do meu curr\u00EDculo em ingl\u00EAs
tooltip_link_cv_pt=Clique para fazer o download de uma vers\u00E3o pdf do meu curr\u00EDculo em portugu\u00EAs
subtitle_culturedude=CultureDude \u00E9 uma plataforma que ajuda as pessoas a aprender situa\u00E7\u00F5es culturais de forma divertida usando jogos culturais. Eu desenvolvi um port do jogo para dispositivos iOS.
title_done_for_fun=Feito como divers\u00E3o
title_js_life=JS Life
text_jslife=Uma bela implementa\u00E7\u00E3o do Jogo da Vida de Conway, um aut\u00F4mato celular.
title_line_scroller=Line Scroller
text_line_scroller=Um pequeno jogo em javascript baseado em criar e remover par\u00E1grafos. Fiz em algumas horas para testar o conceito.
title_watch_out=Watch out\!
text_watch_out=Jogo baseado na web feito com Java, JSF, Primefaces e Javascript. Simula viagens entre destinos e ocorr\u00EAncia de riscos at\u00E9 o destino.
text_still_adding=Ainda estou adicionando coisas aqui, aguarde... (e volte mais tarde)
title_portfolio_and_projects=Portf\u00F3lio e projetos
subtitle_portfolio_and_projects=Aqui voc\u00EA pode encontrar exemplos de coisas nas quais j\u00E1 trabalhei, projetos que j\u00E1 criei ou desenvolvi, e trabalhos em andamento...
title_serious_business=Coisas s\u00E9rias
title_bazaar=Bazaar
text_bazaar1=Esse projeto \u00E9 parte do projeto Pilviv\u00E4yl\u00E4, que \u00E9 executado pelo Minist\u00E9rio da Educa\u00E7\u00E3o e Cultura da Finl\u00E2ndia e pretende construir servi\u00E7os confi\u00E1veis e f\u00E1ceis de usar para que escolas adquiram servi\u00E7os baseados em nuvem para ajudar em seus esfor\u00E7os educacionais. O projeto Pilviv\u00E4yl\u00E4 pretende criar um novo ecossistema e pr\u00E1ticas para construir ambientes de aprendizado no futuro. Os principais valores no Pilviv\u00E4yl\u00E4 s\u00E3o\:
item_bazaar1=abertura e transpar\u00EAncia
item_bazaar2=dados abertos e open source
item_bazaar3=APIs abertas
item_bazaar4=m\u00E9todos de trabalho dirigidos pela comunidade
text_bazaar2=Eu trabalhei com algumas pessoas durante tr\u00EAs meses e meio para entregar esse projeto com sucesso.
tooltip_bazaar=Clique para acessar Bazaar
tooltip_culturedude=Clique para acessar CultureDude
tooltip_js_life=Clique para acessar JS Life
tooltip_line_scroller=Clique para acessar Line Scroller
tooltip_watch_out=Clique para acessar Watch Out
title_photography=Fotografia - Um hobby e uma paix\u00E3o
subtitle_photography1=Eu n\u00E3o sou um fot\u00F3grafo profissional. Mas eu tenho uma paix\u00E3o por isso.
subtitle_photography2=Fotos s\u00E3o muito mais que imagens. Cada uma delas tem um contexto, um significado, uma motiva\u00E7\u00E3o, um valor, e uma alma... Elas podem retratar a realidade em sua forma mais crua, distorc\u00EA-la, e criar sensa\u00E7\u00F5es e sentimentos \u00FAnicos.
title_more_photos=Mais fotos
this_link=nesse link
text_more_photos=Eu geralmente coloco minhas melhores fotos no meu perfil do DeviantArt. Voc\u00EA pode v\u00EA-las
title_timeline=Linha do tempo - Minha vida
subtitle_timeline=Eu ainda sou jovem, mas j\u00E1 acumulei v\u00E1rias conquistas durante minha vida... D\u00EA uma olhada\:
text_timeline_1992=12 de mar\u00E7o\: Nasci em S\u00E3o Jos\u00E9 dos Campos, S\u00E3o Paulo.
text_timeline_1994=Com 2 anos de idade, tive meu primeiro contato com um computador. Era um 386 com s\u00F3 alguns megabytes de HD que rodava Windows 3.1.
text_timeline_1996=Comecei a aprender ingl\u00EAs atrav\u00E9s de um programa no computador. Tamb\u00E9m comecei a jogar alguns jogos de RPG (como Warcraft e Heroes of Might and Magic).
text_timeline_19971=Brincava com pequenas partes eletr\u00F4nicas como LEDs, motores e baterias e constru\u00EDa meus pr\u00F3prios carrinhos de brinquedo.
text_timeline_19972=Em jogos de computador, fiquei f\u00E3 de alguns FPS (Doom, Duke Nuken 3D, Quake), Sim City 2000 e Railroad Tycoon.
text_timeline_19973=Eu era um grande f\u00E3 de Lego tamb\u00E9m. Costumava construir cidades e monumentos, e estabelecer sistemas sociais, econ\u00F4micos e militares nelas.
text_timeline_2001=Memorizei o nome e as habilidades de todos os primeiros 150 pokemons. \:)
text_timeline_20021=Na escola prim\u00E1ria (na antiga 4\u00AA s\u00E9rie) j\u00E1 demonstrava maestria e paix\u00E3o por computadores, e com a ajuda dos professores eu sugeri, implementei e dei aulas de inclus\u00E3o digital b\u00E1sica para meus colegas de sala, usando o laborat\u00F3rio de computa\u00E7\u00E3o da escola que estava praticamente abandonado.
text_timeline_20022=Minha professora tamb\u00E9m me cedeu alguns hor\u00E1rios semanais da aula dela, para que eu pudesse ensinar qu\u00EDmica b\u00E1sica para meus colegas de sala.
text_timeline_20023=Comecei a ler pelo menos tr\u00EAs livros por semana.
text_timeline_20024=Comecei a praticar jud\u00F4.
text_timeline_20041=Meu pai (que \u00E9 um engenheiro e me ajudou) me fez respons\u00E1vel por todo o projeto de uma casa que meus pais constru\u00EDram. Eu desenvolvi todos os projetos civis, el\u00E9tricos, hidr\u00E1ulicos e estruturais junto com a arquitetura.
text_timeline_20042=Tamb\u00E9m tive minhas primeiras experi\u00EAncias brincando com HTML e tentando fazer um site est\u00E1tico sobre jogos.
text_timeline_20043=Comecei a fazer nata\u00E7\u00E3o.
text_timeline_20045=Ganhei uma medalha num campeonato regional de xadrez.
text_timeline_20051=Na 7\u00AA s\u00E9rie, desenvolvi minha orat\u00F3ria em fundar, participar e me eleger presidente nas primeiras elei\u00E7\u00F5es do Gr\u00EAmio Estudantil da escola.
text_timeline_20061=Fui reeleito como presidente do Gr\u00EAmio Estudantil.
text_timeline_20062=Again, I participated in the Brazilian Mathematical Olympiad of Public Schools (OBMEP), getting another honor certificate along with a medal, and another year of CNPq Jr. Scientific Initiation program.
text_timeline_20063=Meu primeiro contato com programa\u00E7\u00E3o de computadores em VB.
text_timeline_20064=Fiz um exame de entrada para o Col\u00E9gio Embraer Juarez Wanderley, no qual fiquei em quarto lugar entre mais de 5000 candidatos. Esse col\u00E9gio est\u00E1 entre os melhores do pa\u00EDs.
text_timeline_20072=Dentro do ensino m\u00E9dio, participei de um programa de aulas de engenharia, que durou at\u00E9 2009.
text_timeline_20081=Eu desenvolvi e liderei um projeto para instalar um sistema que reutiliza \u00E1gua de banhos em vasos sanit\u00E1rios nos vesti\u00E1rios do col\u00E9gio, economizando \u00E1gua.
text_timeline_20082=Prestei vestibular para diversas universidades, sendo aceito em praticamente todas. Ent\u00E3o eu escolhi a Universidade de S\u00E3o Paulo - USP.
text_timeline_20091=Ainda no ensino m\u00E9dio, gerenciei um projeto que visava reflorestar uma \u00E1rea atr\u00E1s do col\u00E9gio\: O solo foi recuperado e mais de 300 \u00E1rvores foram plantadas.
text_timeline_20092=Comecei a desenvolver meus interesses por fotografia e moda.
text_timeline_20102=Na universidade, eu sugeri e liderei o "1\u00BA Dia do Descarte Legal", que era um evento para conscientizar sobre o descarte correto de lixo eletr\u00F4nico e promover a coleta na comunidade universit\u00E1ria. Foi muito bem sucedido.
text_timeline_20104=Numa disciplina da faculdade, sugeri altera\u00E7\u00F5es no site da EACH/USP, o que tornou a navega\u00E7\u00E3o acess\u00EDvel para indiv\u00EDduos com defici\u00EAncias visuais.
text_timeline_20132=Nadei em lagos congelados e no Oceano \u00C1rtico (no inverno), vi bandas de metal e conheci o Papai Noel, fui a saunas e dirigi um tren\u00F3 de huskies.
text_timeline_20133=Na Finl\u00E2ndia, fiz cursos de Visualiza\u00E7\u00E3o de Informa\u00E7\u00E3o, Uso e Usu\u00E1rios de M\u00EDdias Interativas, Gerenciamento de E-Business, Engenharia de Requisitos, e do idioma Finland\u00EAs.
text_timeline_20141=Fiz cursos de Princ\u00EDpios de Usabilidade, Experi\u00EAncia do Usu\u00E1rio e Interfaces de Usu\u00E1rio; Design e Avalia\u00E7\u00E3o de Experi\u00EAncias de Uso para Web Services e Jogos; M\u00EDdias Interativas, Sociedade e Cultura; e Design de jogos.
text_timeline_20143=Viajei para Roma, na It\u00E1lia.
text_timeline_20144=Comecei a trabalhar com aplicativos m\u00F3veis remotamente.